# sqlalchemy

Recommended exercises: <https://www.w3resource.com/sql-exercises/>

Another place to just practice SQL queries: <http://sqlfiddle.com>

sqlalchemy allows us to connect and interact with databases from within Python

Most of your SQL experience will be with connecting to a database that already exists. Most data analysts / data scientists are not the data base administrator and this is not a database administration course.

You can download the chinook database file from the chinook database github:

https://github.com/lerocha/chinook-database/tree/master/ChinookDatabase/DataSources

In [ ]:
import pandas as pd

In [ ]:
from sqlalchemy import create_engine

# create_engine creates a connection to an existing database
# I have 'Chinook_sqlite.sqlite' downloaded into my folder, and python
# connects to this database
engine = create_engine('sqlite:///Chinook_Sqlite.sqlite')

In [ ]:
# Save the table names to a list: table_names
table_names = engine.table_names()

# Print the table names to the shell
print(table_names)

Once we have the database engine created, we can begin executing SQL queries by establishing a connection with the database.

In [ ]:
# Open engine connection
con = engine.connect()

# Perform query
rs = con.execute('SELECT * FROM Album')

# Save results of the query to DataFrame
df = pd.DataFrame(rs.fetchall())

# Close connection
con.close()

# Print head of query results
print(df.head())
print(rs.keys())

Instead of having to open and close the engine connection, we can use Python's with statement which will automatically open and close the connection for us

In [ ]:
# We can write our SQL command enclosed in triple quotes
command = '''
SELECT LastName, Title 
FROM Employee
'''

# SELECT chooses the desired columns
# FROM indicates the table to query

with engine.connect() as con:
    rs = con.execute(command)
    df = pd.DataFrame(rs.fetchall())
    df.columns = rs.keys()

print(df)

Pandas offers functionality to directly query a SQL database using an existing engine

In [ ]:
# we can use the same command as earlier:
df = pd.read_sql_query(command, engine)
df

ORDER BY is SQL's version of sort

<https://www.w3schools.com/sql/sql_orderby.asp>

`
SELECT column1, column2, ...
FROM table_name
ORDER BY column1, column2, ... ASC|DESC;
`

In [ ]:
command = '''
SELECT * 
FROM Employee 
ORDER BY Birthdate DESC
'''
pd.read_sql_query(command, engine)

Filter row selection with WHERE. (similar to using if as a boolean mask)

SQL uses single equal sign = for comparison

In [ ]:
command = '''
SELECT * 
FROM Employee 
WHERE EmployeeId >= 6 AND Title = 'IT Staff'
ORDER BY BirthDate
'''
pd.read_sql_query(command, engine)

We can look at data across multiple tables using a JOIN

LIMIT acts like "head()", and limits the number of entries it returns

In [ ]:
command = '''
SELECT * 
FROM Album
LIMIT 10
'''
pd.read_sql_query(command, engine)

In [ ]:
command = '''
SELECT * 
FROM Artist
LIMIT 10
'''
pd.read_sql_query(command, engine)

In [ ]:
command = '''
SELECT * 
FROM Album
INNER JOIN Artist ON Album.ArtistId = Artist.ArtistId
LIMIT 10
'''
pd.read_sql_query(command, engine)

In [ ]:
command = '''
SELECT Title AS "Album Title", Name AS "Artist Name"
FROM Album
INNER JOIN Artist ON Album.ArtistId = Artist.ArtistId
LIMIT 10
'''
pd.read_sql_query(command, engine)

In [ ]:
command = '''
SELECT Artist.ArtistId, Name, COUNT(AlbumId) AS album_count
FROM Album
INNER JOIN Artist ON Album.ArtistId = Artist.ArtistId
GROUP BY Artist.ArtistId
LIMIT 10
'''
pd.read_sql_query(command, engine)

In [ ]:
command = '''
SELECT * 
FROM Album
ORDER BY ArtistId
LIMIT 15
'''

pd.read_sql_query(command, engine)

In [ ]:
# Conditionals on the Group By must be done with 'HAVING'
command = '''
SELECT Artist.ArtistId, Name, COUNT(AlbumId) AS album_count
FROM Album
INNER JOIN Artist ON Album.ArtistId = Artist.ArtistId
GROUP BY Artist.ArtistId
HAVING album_count > 8
'''
pd.read_sql_query(command, engine)

In [ ]:
command = '''
SELECT ArtistId, ArtistId * 2 AS "magic number", Name
From Artist 
LIMIT 10
'''
pd.read_sql_query(command, engine)